app/controllers/api/desks_controller.rb

SELECT "desks".* FROM "desks"
---
  def index
    @desks = Desk.all

INSERT INTO "desks" ("title", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "hello"], ["author_id", 39], ["created_at", "2021-02-12 05:18:36.169214"], ["updated_at", "2021-02-12 05:18:36.169214"]]
---
  def create
    @desk = current_user.desks.new(desk_params)
    if @desk.save

SELECT  "desks".* FROM "desks" WHERE "desks"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]
SELECT "lists".* FROM "lists" WHERE "lists"."desk_id" = $1  [["desk_id", 16]]
SELECT "papers".* FROM "papers" WHERE "papers"."list_id" IN ($1, $2)  [["list_id", 68], ["list_id", 69]]
---
  def show
    @desk = Desk.includes(:lists, :papers).find(params[:id])

SELECT  "desks".* FROM "desks" WHERE "desks"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
UPDATE "desks" SET "title" = $1, "updated_at" = $2 WHERE "desks"."id" = $3  [["title", "Yes Great"], ["updated_at", "2021-02-19 17:34:06.968885"], ["id", 147]]
---
  def update
    # debugger
    @desk = Desk.find_by(id: params[:id])
    if @desk && current_user.id == @desk.author_id
      if @desk.update(desk_params)

SELECT  "desks".* FROM "desks" WHERE "desks"."id" = $1 LIMIT $2  [["id", 148], ["LIMIT", 1]]
DELETE FROM "desks" WHERE "desks"."id" = $1  [["id", 148]]
---
  def destroy
    @desk = Desk.find(params[:id])
    if @desk && @desk.author_id == current_user.id
      @desk.destroy