app/controllers/api/desk_memberships_controller.rb

  def create
    @desk_membership = DeskMembership.new(membership_params)
    DeskMembership.find_each do |membership|
      if membership.user_id == @desk_membership.user_id && membership.desk_id == @desk_membership.desk_id
        return render json: ['User already a member!'], status: 422
      end
    end

    if @desk_membership.save
      @new_member = User.find(@desk_membership.user_id)
---
INSERT INTO "desk_memberships" ("user_id", "desk_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 52], ["desk_id", 14], ["created_at", "2021-02-16 22:10:55.289404"], ["updated_at", "2021-02-16 22:10:55.289404"]]
SELECT  "desks".* FROM "desks" WHERE "desks"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 52], ["LIMIT", 1]]