app/controllers/api/lists_controller.rb

  def create
    @list = current_user.lists.new(list_params)
    if @list.save
---
INSERT INTO "lists" ("title", "desk_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "sadasd"], ["desk_id", 15], ["author_id", 50], ["created_at", "2021-03-09 21:49:47.774706"], ["updated_at", "2021-03-09 21:49:47.774706"]]

  def destroy
    @list = List.find(params[:id])
    if @list && @list.destroy
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 58], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = $1  [["id", 52]]