app/controllers/api/papers_controller.rb

  def create
    @paper = Paper.new(paper_params)
    if @paper.save
---
INSERT INTO "papers" ("title", "list_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "new paper"], ["list_id", 55], ["author_id", 50], ["created_at", "2021-03-10 03:08:22.265977"], ["updated_at", "2021-03-10 03:08:22.265977"]]