app/controllers/api/users_controller.rb

SELECT "users"."id" FROM "users" WHERE "users"."email" = $1  [["email", "lulu@io.com"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 52], ["LIMIT", 1]]
---
  def index
    email = params[:email]
    user_id = User.where(email: email).pluck(:id)
    @user = User.find_by(id: user_id[0])

INSERT INTO "users" ("username", "email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT "users".* FROM "users"
---
  def create
    @user = User.new(user_params)
    if @user.save
      login!(@user)
      render :show
    else
      @user.errors.full_messages.each do |error|