app/views/api/lists/index.json.jbuilder

SELECT "lists".* FROM "lists"
---

List.all.each do |list|