app/views/api/lists/show.json.jbuilder

SELECT "papers".* FROM "papers" WHERE "papers"."list_id" = $1  [["list_id", 58]]
---
  debugger
  @list.papers.to_a.each do |paper|