app/views/api/desks/index.json.jbuilder

SELECT "desks".* FROM "desks"
---
#fetch only what belong to user
Desk.all.each do |desk|

SELECT "desk_memberships".* FROM "desk_memberships"
SELECT "desks".* FROM "desks"
---
# fetch shared desks
DeskMembership.all.each do |membership|
  if membership.user_id == current_user.id
    Desk.all.each do |desk|