app/views/api/desks/show.json.jbuilder

json.lists do
  @desk.lists.to_a.each do |listy|
---
SELECT "lists".* FROM "lists" WHERE "lists"."desk_id" = $1  [["desk_id", 15]]

json.papers do
  @desk.papers.to_a.each do |paper|
---
SELECT "papers".* FROM "papers" INNER JOIN "lists" ON "papers"."list_id" = "lists"."id" WHERE "lists"."desk_id" = $1  [["desk_id", 151]]