app/models/user.rb

  def reset_sesssion_token!
    self.session_token = SecureRandom::urlsafe_base64
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "WtlEEiJSGkWhGAhuc7e5Zg"], ["updated_at", "2021-02-19 19:06:51.133527"], ["id", 50]]